src/test/testtool/ZoekMetGeslachtsnaamEnGeboortedatum/01/response.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Body><BG:npsLa01 xmlns:BG="http://www.egem.nl/StUF/sector/bg/0310" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:StUF="http://www.egem.nl/StUF/StUF0301" xmlns:a="http://www.egem.nl/StUF/StUF0301" xmlns:gml="http://www.opengis.net/gml" xmlns:ns="http://www.egem.nl/StUF/sector/bg/0310" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xlink="http://www.w3.org/1999/xlink" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<BG:stuurgegevens>
		<StUF:berichtcode>La01</StUF:berichtcode>
		<StUF:zender>
			<StUF:organisatie>NEDGR</StUF:organisatie>
			<StUF:applicatie>NEDMAG_VnA</StUF:applicatie>
		</StUF:zender>
		<StUF:ontvanger>
			<StUF:organisatie>0518</StUF:organisatie>
			<StUF:applicatie>DEC_ZKN</StUF:applicatie>
			<StUF:gebruiker>SH2102</StUF:gebruiker>
		</StUF:ontvanger>
		<StUF:crossRefnummer>60c50a8f-d08c-483c-be67-2ab1a6bb9224</StUF:crossRefnummer>
		<StUF:entiteittype>NPS</StUF:entiteittype>
	</BG:stuurgegevens>
	<BG:parameters>
		<StUF:indicatorVervolgvraag>false</StUF:indicatorVervolgvraag>
		<StUF:aantalVoorkomens>1</StUF:aantalVoorkomens>
	</BG:parameters>
	<BG:antwoord>
		<BG:object StUF:entiteittype="NPS" StUF:sleutelVerzendend="ac47aaecf19c4a1c779f4c64c05c84a7c0c17d54">
			<BG:inp.bsn>999992703</BG:inp.bsn>
			<BG:inp.a-nummer StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:geslachtsnaam>Rafi</BG:geslachtsnaam>
			<BG:voorvoegselGeslachtsnaam>El</BG:voorvoegselGeslachtsnaam>
			<BG:voorletters>M.</BG:voorletters>
			<BG:voornamen>Mohamed</BG:voornamen>
			<BG:aanduidingNaamgebruik StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:geslachtsnaamPartner StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:voorvoegselGeslachtsnaamPartner StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:aanhefAanschrijving StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:voornamenAanschrijving StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:geslachtsnaamAanschrijving StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:adellijkeTitelPredikaat xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:geslachtsaanduiding>M</BG:geslachtsaanduiding>
			<BG:geboortedatum>19490228</BG:geboortedatum>
			<BG:inp.geboorteplaats StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:inp.geboorteLand StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:overlijdensdatum StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:verblijfsadres>
				<BG:aoa.identificatie StUF:noValue="geenWaarde" xsi:nil="true"/>
				<BG:wpl.woonplaatsNaam>'S-GRAVENHAGE</BG:wpl.woonplaatsNaam>
				<BG:aoa.woonplaatsWaarinGelegen>
					<BG:wpl.identificatie xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
					<BG:wpl.woonplaatsNaam xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
				</BG:aoa.woonplaatsWaarinGelegen>
				<BG:gor.identificatie xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
				<BG:opr.identificatie xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
				<BG:gor.openbareRuimteNaam>Ivoorhorst</BG:gor.openbareRuimteNaam>
				<BG:gor.straatnaam StUF:noValue="geenWaarde" xsi:nil="true"/>
				<BG:aoa.postcode>2592 TH</BG:aoa.postcode>
				<BG:aoa.huisnummer>155</BG:aoa.huisnummer>
				<BG:aoa.huisletter StUF:noValue="geenWaarde" xsi:nil="true"/>
				<BG:aoa.huisnummertoevoeging StUF:noValue="geenWaarde" xsi:nil="true"/>
				<BG:inp.locatiebeschrijving StUF:noValue="geenWaarde" xsi:nil="true"/>
				<BG:begindatumVerblijf StUF:noValue="geenWaarde" xsi:nil="true"/>
			</BG:verblijfsadres>
			<BG:sub.correspondentieAdres/>
			<BG:sub.telefoonnummer xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:sub.faxnummer xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:sub.emailadres xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:sub.url xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:sub.rekeningnummerBankGiro xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:inp.burgerlijkeStaat StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:inp.gemeenteVanInschrijving StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:inp.datumInschrijving StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:vbt.aanduidingVerblijfstitel xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:inp.datumVestigingInNederland StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:inp.immigratieLand StUF:noValue="geenWaarde" xsi:nil="true"/>
			<BG:inp.datumVertrekUitNederland xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:inp.emigratieLand xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:ing.indicatieGezagMinderjarige xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
			<BG:inp.indicatieGeheim xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
		</BG:object>
	</BG:antwoord>
</BG:npsLa01></soapenv:Body></soapenv:Envelope>